{
	"программное обеспечение": "Совокупность программ системы обработки информации и программных документов, необходимых для их эксплуатации.",
	"прогрессивное веб-приложение ": "Веб-приложение, разработанное с использованием ряда специальных технологий и стандартных шаблонов, которые позволяют ему использовать преимущества как веб-приложений, так и нативных функций.",
	"нативное приложение": "Приложение, которое работает только с определенной операционной системой, используя свои IDE и SDK. Нативные приложения имеют возможность использовать аппаратное и программное обеспечение для конкретного устройства и могут обеспечивать качество с огромными показателями производительности.",
	"веб-приложение": "Любая компьютерная программа, которая выполняет определенную функцию, используя в качестве клиента веб-браузер.",
	"клиент-сервер": "Вычислительная или сетевая архитектура, в которой задания или сетевая нагрузка распределены между поставщиками услуг (сервисов), называемыми серверами, и заказчиками услуг, называемыми клиентами.",
	"протокол": "Система правил, которые определяют, как происходит обмен данными внутри компьютеров или между ними.",
	"http": "Прикладной протокол для передачи гипертекстовых документов, таких как HTML. Он создан для связи между веб-браузерами и веб-серверами, хотя в принципе HTTP может использоваться и для других целей. Протокол следует классической клиент-серверной модели, когда клиент открывает соединение для создания запроса, а затем ждет ответа. Это протокол без сохранения состояния, то есть сервер не сохраняет никаких данных (состояние) между двумя парами 'запрос-ответ'.",
	"html": "Язык разметки, который используется для структурирования и отображения веб-страницы и её контента.",
	"css": "Язык таблицы стилей, который используется для стилизации веб-страницы. Это означает, что он позволяет применять стили выборочно к элементам в документах HTML.",
	"javascript": "Скриптовый язык, который позволяет реализовать сложные функции на веб-страницах, например: отображение своевременных обновлений контента, интерактивных карт, анимированной 2D/3D графики и т.д.",
	"https": "Является зашифрованной версией протокола HTTP. Он использует SSL или TLS для шифрования всей связи между клиентом и сервером. Это безопасное соединение позволяет клиентам безопасно обмениваться конфиденциальными данными с сервером, например, при совершении банковских операций или покупок через Интернет.",
	"notifications api": "Инструмент, который позволяет веб-страницам управлять отображением системных уведомлений для конечного пользователя. Они находятся за пределами контекстного экрана просмотра верхнего уровня, поэтому могут отображаться даже в том случае, если пользователь переключил вкладки или перешел в другое приложение. API разработан для совместимости с существующими системами уведомлений на различных платформах.",
	"web workers api": "Инструмент, который позволяет выполнять скриптовую операцию в фоновом потоке, отделенном от основного потока выполнения веб-приложения. Преимуществом этого является то, что трудоемкая обработка может выполняться в отдельном потоке, что позволяет основному (обычно пользовательскому) потоку запускаться без блокировки/замедления",
	"service worker api": "Проксирующий слой, которые располагаются между веб-приложениями, браузером и сетью (когда это доступно). Предназначен, среди прочего, для создания эффективной работы в автономном режиме, перехвата сетевых запросов и принятия соответствующих мер в зависимости от того, доступна ли сеть, а также для обновления активов, находящихся на сервере. Он также позволят получить доступ к push-уведомлениям и интерфейсам фоновой синхронизации.",
	"a2hs": "Функция, доступная в современных браузерах, которая позволяет пользователю 'установить' веб-приложение, т.е. добавить ярлык на главный экран, представляющий его любимое веб-приложение (или сайт), чтобы впоследствии получить к нему доступ одним нажатием."
}